Documents/ФискальнаяПродажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ФискальнаяПродажа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПродажиПоДисконтнымКартам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КассоваяСмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КассовоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФискальнаяОперация</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ФискальнаяПродажа/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// Получаем текущую строку
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	// Заполняем цену с сервера
	ТекСтрока.Цена = ПолучитьЦенуНаСервере(Объект.Дата, ТекСтрока.Номенклатура);
	
	// Дефолтные значения
	Если ТекСтрока.Количество = 0 Тогда
		ТекСтрока.Количество = 1;
	КонецЕсли;
	
	// Расчет суммы
	РассчитатьСуммуСтроки(ТекСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	РассчитатьСуммуСтроки(ТекСтрока);
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуСтроки(СтрокаТаблицы)
	
	СтрокаТаблицы.Сумма = СтрокаТаблицы.Количество * СтрокаТаблицы.Цена;
	
	// Пересчет итога документа (если нужно отображать в подвале)
	РассчитатьИтогДокумента();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтогДокумента()
	
	Объект.СуммаДокумента = 0;
	Для Каждого Стр Из Объект.Товары Цикл
		Объект.СуммаДокумента = Объект.СуммаДокумента + Стр.Сумма;
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуНаСервере(ДатаДок, НоменклатураСсылка)
	// Обращаемся к нашему общему модулю
	Возврат ОбщегоНазначения.ПолучитьРозничнуюЦену(ДатаДок, НоменклатураСсылка);
КонецФункции	

// --- БЛОК 1: СКАНИРОВАНИЕ (SMARTSCAN) ---

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	// Фильтруем события (зависит от настроек драйвера, здесь пример)
	Если ВРег(Событие) = "BARCODE" ИЛИ ВРег(Событие) = "ШТРИХКОД" Тогда
		ОбработатьШтрихкод(Данные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкод(Штрихкод)
	
	// 1. Ищем товары на сервере
	// Вызываем наш исправленный экспортный метод
	НайденныеТовары = НайтиТоварыПоШтрихкодуНаСервере(Штрихкод);
	
	КоличествоНайденных = НайденныеТовары.Количество();
	
	Если КоличествоНайденных = 0 Тогда
		// Сценарий 1: Ничего не найдено
		Сообщить("Товар со штрихкодом " + Штрихкод + " не найден.");
		
	ИначеЕсли КоличествоНайденных = 1 Тогда
		// Сценарий 2: Однозначное совпадение - добавляем сразу
		ДобавитьТоварВКорзину(НайденныеТовары[0]);
		
	Иначе
        // Сценарий 3: КОЛЛИЗИЯ (SmartScan)
        СписокДляВыбора = Новый СписокЗначений;
        
        Для Каждого ТекТовар Из НайденныеТовары Цикл
            СписокДляВыбора.Добавить(ТекТовар, ТекТовар.Представление);
        КонецЦикла;
        
        Оповещение = Новый ОписаниеОповещения("ПослеВыбораТовараИзСписка", ЭтотОбъект);
        
        // ИСПРАВЛЕНИЕ ЗДЕСЬ:
        // 1-й параметр: Оповещение
        // 2-й параметр: Список
        // 3-й параметр: ЭлементФормы -> Неопределено (чтобы окно было по центру)
        // 4-й параметр: Заголовок
	    ПоказатьВыборИзСписка(Оповещение, СписокДляВыбора, Неопределено,1);
	        
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ДобавитьТоварВКорзину(ДанныеТовара)
	
	// Ищем, есть ли уже такая строка, чтобы просто увеличить количество
	НайденнаяСтрока = Неопределено;
	Для Каждого Стр Из Объект.Товары Цикл
		Если Стр.Номенклатура = ДанныеТовара.Номенклатура Тогда
			НайденнаяСтрока = Стр;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если НайденнаяСтрока <> Неопределено Тогда
		НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + 1;
		РассчитатьСуммуСтроки(НайденнаяСтрока); // Метод из прошлого шага
	Иначе
		НоваяСтрока = Объект.Товары.Добавить();
		НоваяСтрока.Номенклатура = ДанныеТовара.Номенклатура;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = ДанныеТовара.Цена;
		// По умолчанию считаем операцию фискальной (можно менять логикой)
		НоваяСтрока.ФискальнаяОперация = Истина; 
		РассчитатьСуммуСтроки(НоваяСтрока);
	КонецЕсли;
	
	// Прокрутка к строке
	Элементы.Товары.ТекущаяСтрока = ?(НайденнаяСтрока <> Неопределено, НайденнаяСтрока.ПолучитьИдентификатор(), НоваяСтрока.ПолучитьИдентификатор());

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораТовараИзСписка(ВыбранныйЭлемент, Параметры) Экспорт
	
	// Если пользователь не нажал "Отмена"
	Если ВыбранныйЭлемент <> Неопределено Тогда
		// ВыбранныйЭлемент.Значение содержит нашу Структуру (Номенклатура, Цена...)
		ДобавитьТоварВКорзину(ВыбранныйЭлемент.Значение);
	КонецЕсли;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция НайтиТоварыПоШтрихкодуНаСервере(Штрихкод)
	Возврат ОбщегоНазначения.НайтиТоварыПоШтрихкоду(Штрихкод, ТекущаяДата());
КонецФункции

&НаКлиенте
Процедура ОбработатьШтрихкодТест(Команда)
	ОбработатьШтрихкод("123");
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьПолеСканирования(Команда)
	// 1. Очищаем поле (на всякий случай)
	ШтрихкодВвод = "";
	
	// 2. ПРИНУДИТЕЛЬНО ставим фокус в поле-ловушку
	// Важно: ПолеВводаШК - это Имя элемента формы, которое мы задали в прошлом шаге
	ТекущийЭлемент = Элементы.ПолеВводаШК;

КонецПроцедуры
